'backend': 'tensorflow'
'keras_version': '2.11.0'
'model_config': '{"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 160, 160, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": [], "shared_object_id": 0}, {"class_name": "Conv2D", "config": {"name": "Conv1", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 1}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 2}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "shared_object_id": 3}, {"class_name": "BatchNormalization", "config": {"name": "bn_Conv1", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 4}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 5}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 6}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 7}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "bn_Conv1", "inbound_nodes": [[["Conv1", 0, 0, {}]]], "shared_object_id": 8}, {"class_name": "ReLU", "config": {"name": "Conv1_relu", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "Conv1_relu", "inbound_nodes": [[["bn_Conv1", 0, 0, {}]]], "shared_object_id": 9}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_depthwise", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 11}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 12}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "expanded_conv_depthwise", "inbound_nodes": [[["Conv1_relu", 0, 0, {}]]], "shared_object_id": 13}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_depthwise_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 14}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 15}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 16}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 17}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_depthwise_BN", "inbound_nodes": [[["expanded_conv_depthwise", 0, 0, {}]]], "shared_object_id": 18}, {"class_name": "ReLU", "config": {"name": "expanded_conv_depthwise_relu", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "expanded_conv_depthwise_relu", "inbound_nodes": [[["expanded_conv_depthwise_BN", 0, 0, {}]]], "shared_object_id": 19}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_project", "trainable": false, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 20}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 21}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_project", "inbound_nodes": [[["expanded_conv_depthwise_relu", 0, 0, {}]]], "shared_object_id": 22}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_project_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 23}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 24}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 25}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 26}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_project_BN", "inbound_nodes": [[["expanded_conv_project", 0, 0, {}]]], "shared_object_id": 27}, {"class_name": "Conv2D", "config": {"name": "block_1_expand", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 28}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 29}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_1_expand", "inbound_nodes": [[["expanded_conv_project_BN", 0, 0, {}]]], "shared_object_id": 30}, {"class_name": "BatchNormalization", "config": {"name": "block_1_expand_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 31}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 32}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 33}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 34}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_1_expand_BN", "inbound_nodes": [[["block_1_expand", 0, 0, {}]]], "shared_object_id": 35}, {"class_name": "ReLU", "config": {"name": "block_1_expand_relu", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "block_1_expand_relu", "inbound_nodes": [[["block_1_expand_BN", 0, 0, {}]]], "shared_object_id": 36}, {"class_name": "ZeroPadding2D", "config": {"name": "block_1_pad", "trainable": false, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "block_1_pad", "inbound_nodes": [[["block_1_expand_relu", 0, 0, {}]]], "shared_object_id": 37}, {"class_name": "DepthwiseConv2D", "config": {"name": "block_1_depthwise", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 39}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 40}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block_1_depthwise", "inbound_nodes": [[["block_1_pad", 0, 0, {}]]], "shared_object_id": 41}, {"class_name": "BatchNormalization", "config": {"name": "block_1_depthwise_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 42}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 43}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 44}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 45}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_1_depthwise_BN", "inbound_nodes": [[["block_1_depthwise", 0, 0, {}]]], "shared_object_id": 46}, {"class_name": "ReLU", "config": {"name": "block_1_depthwise_relu", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "block_1_depthwise_relu", "inbound_nodes": [[["block_1_depthwise_BN", 0, 0, {}]]], "shared_object_id": 47}, {"class_name": "Conv2D", "config": {"name": "block_1_project", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 48}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 49}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_1_project", "inbound_nodes": [[["block_1_depthwise_relu", 0, 0, {}]]], "shared_object_id": 50}, {"class_name": "BatchNormalization", "config": {"name": "block_1_project_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 51}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 52}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 53}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 54}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_1_project_BN", "inbound_nodes": [[["block_1_project", 0, 0, {}]]], "shared_object_id": 55}, {"class_name": "Conv2D", "config": {"name": "block_2_expand", "trainable": false, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 56}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 57}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_2_expand", "inbound_nodes": [[["block_1_project_BN", 0, 0, {}]]], "shared_object_id": 58}, {"class_name": "BatchNormalization", "config": {"name": "block_2_expand_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 59}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 60}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 61}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 62}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_2_expand_BN", "inbound_nodes": [[["block_2_expand", 0, 0, {}]]], "shared_object_id": 63}, {"class_name": "ReLU", "config": {"name": "block_2_expand_relu", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "block_2_expand_relu", "inbound_nodes": [[["block_2_expand_BN", 0, 0, {}]]], "shared_object_id": 64}, {"class_name": "DepthwiseConv2D", "config": {"name": "block_2_depthwise", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 66}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 67}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block_2_depthwise", "inbound_nodes": [[["block_2_expand_relu", 0, 0, {}]]], "shared_object_id": 68}, {"class_name": "BatchNormalization", "config": {"name": "block_2_depthwise_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 69}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 70}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 71}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 72}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_2_depthwise_BN", "inbound_nodes": [[["block_2_depthwise", 0, 0, {}]]], "shared_object_id": 73}, {"class_name": "ReLU", "config": {"name": "block_2_depthwise_relu", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "block_2_depthwise_relu", "inbound_nodes": [[["block_2_depthwise_BN", 0, 0, {}]]], "shared_object_id": 74}, {"class_name": "Conv2D", "config": {"name": "block_2_project", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 75}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 76}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_2_project", "inbound_nodes": [[["block_2_depthwise_relu", 0, 0, {}]]], "shared_object_id": 77}, {"class_name": "BatchNormalization", "config": {"name": "block_2_project_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 78}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 79}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 80}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 81}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_2_project_BN", "inbound_nodes": [[["block_2_project", 0, 0, {}]]], "shared_object_id": 82}, {"class_name": "Add", "config": {"name": "block_2_add", "trainable": false, "dtype": "float32"}, "name": "block_2_add", "inbound_nodes": [[["block_1_project_BN", 0, 0, {}], ["block_2_project_BN", 0, 0, {}]]], "shared_object_id": 83}, {"class_name": "Conv2D", "config": {"name": "block_3_expand", "trainable": false, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 84}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 85}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_3_expand", "inbound_nodes": [[["block_2_add", 0, 0, {}]]], "shared_object_id": 86}, {"class_name": "BatchNormalization", "config": {"name": "block_3_expand_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 87}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 88}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 89}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 90}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_3_expand_BN", "inbound_nodes": [[["block_3_expand", 0, 0, {}]]], "shared_object_id": 91}, {"class_name": "ReLU", "config": {"name": "block_3_expand_relu", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "block_3_expand_relu", "inbound_nodes": [[["block_3_expand_BN", 0, 0, {}]]], "shared_object_id": 92}, {"class_name": "ZeroPadding2D", "config": {"name": "block_3_pad", "trainable": false, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "block_3_pad", "inbound_nodes": [[["block_3_expand_relu", 0, 0, {}]]], "shared_object_id": 93}, {"class_name": "DepthwiseConv2D", "config": {"name": "block_3_depthwise", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 95}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 96}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block_3_depthwise", "inbound_nodes": [[["block_3_pad", 0, 0, {}]]], "shared_object_id": 97}, {"class_name": "BatchNormalization", "config": {"name": "block_3_depthwise_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 98}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 99}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 100}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 101}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_3_depthwise_BN", "inbound_nodes": [[["block_3_depthwise", 0, 0, {}]]], "shared_object_id": 102}, {"class_name": "ReLU", "config": {"name": "block_3_depthwise_relu", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "block_3_depthwise_relu", "inbound_nodes": [[["block_3_depthwise_BN", 0, 0, {}]]], "shared_object_id": 103}, {"class_name": "Conv2D", "config": {"name": "block_3_project", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 104}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 105}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_3_project", "inbound_nodes": [[["block_3_depthwise_relu", 0, 0, {}]]], "shared_object_id": 106}, {"class_name": "BatchNormalization", "config": {"name": "block_3_project_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 107}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 108}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 109}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 110}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_3_project_BN", "inbound_nodes": [[["block_3_project", 0, 0, {}]]], "shared_object_id": 111}, {"class_name": "Conv2D", "config": {"name": "block_4_expand", "trainable": false, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 112}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 113}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_4_expand", "inbound_nodes": [[["block_3_project_BN", 0, 0, {}]]], "shared_object_id": 114}, {"class_name": "BatchNormalization", "config": {"name": "block_4_expand_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 115}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 116}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 117}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 118}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_4_expand_BN", "inbound_nodes": [[["block_4_expand", 0, 0, {}]]], "shared_object_id": 119}, {"class_name": "ReLU", "config": {"name": "block_4_expand_relu", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "block_4_expand_relu", "inbound_nodes": [[["block_4_expand_BN", 0, 0, {}]]], "shared_object_id": 120}, {"class_name": "DepthwiseConv2D", "config": {"name": "block_4_depthwise", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 122}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 123}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block_4_depthwise", "inbound_nodes": [[["block_4_expand_relu", 0, 0, {}]]], "shared_object_id": 124}, {"class_name": "BatchNormalization", "config": {"name": "block_4_depthwise_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 125}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 126}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 127}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 128}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_4_depthwise_BN", "inbound_nodes": [[["block_4_depthwise", 0, 0, {}]]], "shared_object_id": 129}, {"class_name": "ReLU", "config": {"name": "block_4_depthwise_relu", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "block_4_depthwise_relu", "inbound_nodes": [[["block_4_depthwise_BN", 0, 0, {}]]], "shared_object_id": 130}, {"class_name": "Conv2D", "config": {"name": "block_4_project", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 131}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 132}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_4_project", "inbound_nodes": [[["block_4_depthwise_relu", 0, 0, {}]]], "shared_object_id": 133}, {"class_name": "BatchNormalization", "config": {"name": "block_4_project_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 134}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 135}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 136}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 137}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_4_project_BN", "inbound_nodes": [[["block_4_project", 0, 0, {}]]], "shared_object_id": 138}, {"class_name": "Add", "config": {"name": "block_4_add", "trainable": false, "dtype": "float32"}, "name": "block_4_add", "inbound_nodes": [[["block_3_project_BN", 0, 0, {}], ["block_4_project_BN", 0, 0, {}]]], "shared_object_id": 139}, {"class_name": "Conv2D", "config": {"name": "block_5_expand", "trainable": false, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 140}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 141}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_5_expand", "inbound_nodes": [[["block_4_add", 0, 0, {}]]], "shared_object_id": 142}, {"class_name": "BatchNormalization", "config": {"name": "block_5_expand_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 143}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 144}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 145}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 146}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_5_expand_BN", "inbound_nodes": [[["block_5_expand", 0, 0, {}]]], "shared_object_id": 147}, {"class_name": "ReLU", "config": {"name": "block_5_expand_relu", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "block_5_expand_relu", "inbound_nodes": [[["block_5_expand_BN", 0, 0, {}]]], "shared_object_id": 148}, {"class_name": "DepthwiseConv2D", "config": {"name": "block_5_depthwise", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 150}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 151}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block_5_depthwise", "inbound_nodes": [[["block_5_expand_relu", 0, 0, {}]]], "shared_object_id": 152}, {"class_name": "BatchNormalization", "config": {"name": "block_5_depthwise_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 153}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 154}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 155}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 156}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_5_depthwise_BN", "inbound_nodes": [[["block_5_depthwise", 0, 0, {}]]], "shared_object_id": 157}, {"class_name": "ReLU", "config": {"name": "block_5_depthwise_relu", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "block_5_depthwise_relu", "inbound_nodes": [[["block_5_depthwise_BN", 0, 0, {}]]], "shared_object_id": 158}, {"class_name": "Conv2D", "config": {"name": "block_5_project", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 159}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 160}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_5_project", "inbound_nodes": [[["block_5_depthwise_relu", 0, 0, {}]]], "shared_object_id": 161}, {"class_name": "BatchNormalization", "config": {"name": "block_5_project_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 162}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 163}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 164}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 165}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_5_project_BN", "inbound_nodes": [[["block_5_project", 0, 0, {}]]], "shared_object_id": 166}, {"class_name": "Add", "config": {"name": "block_5_add", "trainable": false, "dtype": "float32"}, "name": "block_5_add", "inbound_nodes": [[["block_4_add", 0, 0, {}], ["block_5_project_BN", 0, 0, {}]]], "shared_object_id": 167}, {"class_name": "Conv2D", "config": {"name": "block_6_expand", "trainable": false, "dtype": "float32", "filters": 192, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 168}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 169}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_6_expand", "inbound_nodes": [[["block_5_add", 0, 0, {}]]], "shared_object_id": 170}, {"class_name": "BatchNormalization", "config": {"name": "block_6_expand_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 171}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 172}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 173}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 174}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_6_expand_BN", "inbound_nodes": [[["block_6_expand", 0, 0, {}]]], "shared_object_id": 175}, {"class_name": "ReLU", "config": {"name": "block_6_expand_relu", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "block_6_expand_relu", "inbound_nodes": [[["block_6_expand_BN", 0, 0, {}]]], "shared_object_id": 176}, {"class_name": "ZeroPadding2D", "config": {"name": "block_6_pad", "trainable": false, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "block_6_pad", "inbound_nodes": [[["block_6_expand_relu", 0, 0, {}]]], "shared_object_id": 177}, {"class_name": "DepthwiseConv2D", "config": {"name": "block_6_depthwise", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 179}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 180}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block_6_depthwise", "inbound_nodes": [[["block_6_pad", 0, 0, {}]]], "shared_object_id": 181}, {"class_name": "BatchNormalization", "config": {"name": "block_6_depthwise_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 182}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 183}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 184}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 185}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_6_depthwise_BN", "inbound_nodes": [[["block_6_depthwise", 0, 0, {}]]], "shared_object_id": 186}, {"class_name": "ReLU", "config": {"name": "block_6_depthwise_relu", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "block_6_depthwise_relu", "inbound_nodes": [[["block_6_depthwise_BN", 0, 0, {}]]], "shared_object_id": 187}, {"class_name": "Conv2D", "config": {"name": "block_6_project", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 188}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 189}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_6_project", "inbound_nodes": [[["block_6_depthwise_relu", 0, 0, {}]]], "shared_object_id": 190}, {"class_name": "BatchNormalization", "config": {"name": "block_6_project_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 191}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 192}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 193}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 194}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_6_project_BN", "inbound_nodes": [[["block_6_project", 0, 0, {}]]], "shared_object_id": 195}, {"class_name": "Conv2D", "config": {"name": "block_7_expand", "trainable": false, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 196}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 197}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_7_expand", "inbound_nodes": [[["block_6_project_BN", 0, 0, {}]]], "shared_object_id": 198}, {"class_name": "BatchNormalization", "config": {"name": "block_7_expand_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 199}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 200}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 201}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 202}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_7_expand_BN", "inbound_nodes": [[["block_7_expand", 0, 0, {}]]], "shared_object_id": 203}, {"class_name": "ReLU", "config": {"name": "block_7_expand_relu", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "block_7_expand_relu", "inbound_nodes": [[["block_7_expand_BN", 0, 0, {}]]], "shared_object_id": 204}, {"class_name": "DepthwiseConv2D", "config": {"name": "block_7_depthwise", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 206}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 207}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block_7_depthwise", "inbound_nodes": [[["block_7_expand_relu", 0, 0, {}]]], "shared_object_id": 208}, {"class_name": "BatchNormalization", "config": {"name": "block_7_depthwise_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 209}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 210}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 211}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 212}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_7_depthwise_BN", "inbound_nodes": [[["block_7_depthwise", 0, 0, {}]]], "shared_object_id": 213}, {"class_name": "ReLU", "config": {"name": "block_7_depthwise_relu", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "block_7_depthwise_relu", "inbound_nodes": [[["block_7_depthwise_BN", 0, 0, {}]]], "shared_object_id": 214}, {"class_name": "Conv2D", "config": {"name": "block_7_project", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 215}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 216}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_7_project", "inbound_nodes": [[["block_7_depthwise_relu", 0, 0, {}]]], "shared_object_id": 217}, {"class_name": "BatchNormalization", "config": {"name": "block_7_project_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 218}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 219}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 220}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 221}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_7_project_BN", "inbound_nodes": [[["block_7_project", 0, 0, {}]]], "shared_object_id": 222}, {"class_name": "Add", "config": {"name": "block_7_add", "trainable": false, "dtype": "float32"}, "name": "block_7_add", "inbound_nodes": [[["block_6_project_BN", 0, 0, {}], ["block_7_project_BN", 0, 0, {}]]], "shared_object_id": 223}, {"class_name": "Conv2D", "config": {"name": "block_8_expand", "trainable": false, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 224}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 225}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_8_expand", "inbound_nodes": [[["block_7_add", 0, 0, {}]]], "shared_object_id": 226}, {"class_name": "BatchNormalization", "config": {"name": "block_8_expand_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 227}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 228}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 229}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 230}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_8_expand_BN", "inbound_nodes": [[["block_8_expand", 0, 0, {}]]], "shared_object_id": 231}, {"class_name": "ReLU", "config": {"name": "block_8_expand_relu", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "block_8_expand_relu", "inbound_nodes": [[["block_8_expand_BN", 0, 0, {}]]], "shared_object_id": 232}, {"class_name": "DepthwiseConv2D", "config": {"name": "block_8_depthwise", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 234}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 235}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "block_8_depthwise", "inbound_nodes": [[["block_8_expand_relu", 0, 0, {}]]], "shared_object_id": 236}, {"class_name": "BatchNormalization", "config": {"name": "block_8_depthwise_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 237}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 238}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 239}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 240}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_8_depthwise_BN", "inbound_nodes": [[["block_8_depthwise", 0, 0, {}]]], "shared_object_id": 241}, {"class_name": "ReLU", "config": {"name": "block_8_depthwise_relu", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "block_8_depthwise_relu", "inbound_nodes": [[["block_8_depthwise_BN", 0, 0, {}]]], "shared_object_id": 242}, {"class_name": "Conv2D", "config": {"name": "block_8_project", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 243}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 244}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_8_project", "inbound_nodes": [[["block_8_depthwise_relu", 0, 0, {}]]], "shared_object_id": 245}, {"class_name": "BatchNormalization", "config": {"name": "block_8_project_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 246}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 247}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 248}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 249}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_8_project_BN", "inbound_nodes": [[["block_8_project", 0, 0, {}]]], "shared_object_id": 250}, {"class_name": "Add", "config": {"name": "block_8_add", "trainable": false, "dtype": "float32"}, "name": "block_8_add", "inbound_nodes": [[["block_7_add", 0, 0, {}], ["block_8_project_BN", 0, 0, {}]]], "shared_object_id": 251}, {"class_name": "Conv2D", "config": {"name": "block_9_expand", "trainable": false, "dtype": "float32", "filters": 384, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 252}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 253}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "block_9_expand", "inbound_nodes": [[["block_8_add", 0, 0, {}]]], "shared_object_id": 254}, {"class_name": "BatchNormalization", "config": {"name": "block_9_expand_BN", "trainable": false, "dtype": "float32", "axis": [3], "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 255}, "gamma_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 256}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 257}, "moving_variance_initializer": {"class_name": "Ones", "config": {}, "shared_object_id": 258}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "block_9_expand_BN", "inbound_nodes": [[["block_9_expand", 0, 0, {}]]], "shared_object_id": 259}, {"class_name": "ReLU", "config": {"name": "block_9_expand_relu", "trainable": false, "dtype": "float32", "max_value": 6.0, "negative_slope": 0.0, "threshold": 0.0}, "name": "block_9_expand_relu", "inbound_nodes": [[["block_9_expand_BN", 0, 0, {}]]], "shared_object_id": 260}, {"class_name": "DepthwiseConv2D", "config": {"name": "block_9_depthwise", "trainable": false, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 262}, "bias_regularizer": null, 